<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"99d50e53953cfb2e20ce852dc3343e687e816e0b30c976694d985d5466986808","plan_job_ref":"Job Create MPE Management terraform plan #78 at https://github.com/AFMPE/mpe_management/actions/runs/4844999571","plan_hash":"7c64b6f5a5bb6add31a74f61cc8f25feed221310c37ae2b02564e660c9c8de99","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 5 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["AAD_No_Password_Expiry"] will be updated in-place
  ~ resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
        id                         = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log/providers/Microsoft.SecurityInsights/alertRules/AAD_No_Password_Expiry"
        name                       = "AAD_No_Password_Expiry"
        # (14 unchanged attributes hidden)

      ~ entity_mapping {
            # (1 unchanged attribute hidden)

          ~ field_mapping {
              ~ identifier  = "FullName" -> "HostName"
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["Malicious_Web"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "AAD_No_Password_Expiry"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "Malicious_Web"
      + query                      = <<-EOT
            let queryperiod = 1d;
            let mode = 'Blocked';
            let successCode = dynamic(['200', '101','204', '400','504','304','401','500']);
            let sessionBin = 30m;
            AzureDiagnostics
            | where TimeGenerated > ago(queryperiod)
            | where Category == 'ApplicationGatewayFirewallLog' and action_s == mode
            | sort by hostname_s asc, clientIp_s asc, TimeGenerated asc
            | extend SessionBlockedStarted = row_window_session(TimeGenerated, queryperiod, 10m, ((clientIp_s != prev(clientIp_s)) or (hostname_s != prev(hostname_s))))
            | summarize SessionBlockedEnded = max(TimeGenerated), SessionBlockedCount = count() by hostname_s, clientIp_s, SessionBlockedStarted
            | extend TimeKey = range(bin(SessionBlockedStarted, sessionBin), bin(SessionBlockedEnded, sessionBin), sessionBin)
            | mv-expand TimeKey to typeof(datetime)
            | join kind = inner(
                AzureDiagnostics
                | where TimeGenerated > ago(queryperiod)
                | where Category == 'ApplicationGatewayAccessLog' and (isempty(httpStatus_d) or httpStatus_d in (successCode))
                | extend TimeKey = bin(TimeGenerated, sessionBin)
            ) on TimeKey, $left.hostname_s == $right.host_s, $left.clientIp_s == $right.clientIP_s
            | where TimeGenerated between (SessionBlockedStarted..SessionBlockedEnded)
            | extend
                originalRequestUriWithArgs_s = column_ifexists("originalRequestUriWithArgs_s", ""),
                serverStatus_s = column_ifexists("serverStatus_s", "")
            | summarize
                SuccessfulAccessCount = count(),
                UserAgents = make_set(userAgent_s, 250),
                RequestURIs = make_set(requestUri_s, 250),
                OriginalRequestURIs = make_set(originalRequestUriWithArgs_s, 250),
                SuccessCodes = make_set(httpStatus_d, 250),
                SuccessCodes_BackendServer = make_set(serverStatus_s, 250),
                take_any(SessionBlockedEnded, SessionBlockedCount)
                by hostname_s, clientIp_s, SessionBlockedStarted
            | where SessionBlockedCount > SuccessfulAccessCount
            | extend timestamp = SessionBlockedStarted, IPCustomEntity = clientIp_s
            | extend BlockvsSuccessRatio = SessionBlockedCount/toreal(SuccessfulAccessCount)
            | sort by BlockvsSuccessRatio desc, timestamp asc
            | project-reorder SessionBlockedStarted, SessionBlockedEnded, hostname_s, clientIp_s, SessionBlockedCount, SuccessfulAccessCount, BlockvsSuccessRatio, SuccessCodes, RequestURIs, OriginalRequestURIs, UserAgents
        EOT
      + query_frequency            = "P1D"
      + query_period               = "P1D"
      + severity                   = "Medium"
      + suppression_duration       = "P1D"
      + suppression_enabled        = false
      + tactics                    = [
          + "InitialAccess",
        ]
      + techniques                 = [
          + "T1190",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "IP"

          + field_mapping {
              + column_name = "IPCustomEntity"
              + identifier  = "Address"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = true
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "P1D"
              + reopen_closed_incidents = true
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Account_Login_CA_Spikes"] will be updated in-place
  ~ resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
        id                         = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log/providers/Microsoft.SecurityInsights/alertRules/User_Account_Login_CA_Spikes"
        name                       = "User_Account_Login_CA_Spikes"
        # (14 unchanged attributes hidden)

      ~ entity_mapping {
            # (1 unchanged attribute hidden)

          ~ field_mapping {
              ~ column_name = "IPCustomEntity" -> "ClientIp"
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Account_Was_Locked_O365"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "User_Account_Was_Locked_O365"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "User_Account_Was_Locked_O365"
      + query                      = <<-EOT
            OfficeActivity 
            | where Operation == "UserLoginFailed" | where * contains "IdsLocked"
        EOT
      + query_frequency            = "PT5H"
      + query_period               = "PT5H"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "CredentialAccess",
        ]
      + techniques                 = [
          + "T1110",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "Account"

          + field_mapping {
              + column_name = "AccountCustomEntity"
              + identifier  = "Name"
            }
        }
      + entity_mapping {
          + entity_type = "IP"

          + field_mapping {
              + column_name = "ClientIp"
              + identifier  = "Address"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = false
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "P1D"
              + reopen_closed_incidents = false
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Added_To_Admin_Grp"] will be updated in-place
  ~ resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
        id                         = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log/providers/Microsoft.SecurityInsights/alertRules/User_Added_To_Admin_Grp"
        name                       = "User_Added_To_Admin_Grp"
        # (14 unchanged attributes hidden)

      ~ entity_mapping {
            # (1 unchanged attribute hidden)

          ~ field_mapping {
              ~ identifier  = "FullName" -> "HostName"
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Added_To_Local_Admins"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "User added to local admins using net.exe"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "User_Added_To_Local_Admins"
      + query                      = <<-EOT
            // Query for local admins being added using "net user" command
            // In this example we look for use possible uses of uncommon commandline options (/ad instead of /add)
            DeviceProcessEvents
            // To find executions of a known filename, it is better to filter on the filename (and possibly on folder path).
            | where FileName in~ ("net.exe", "net1.exe") and TimeGenerated > ago(1h)
            | where ProcessCommandLine has "localgroup administrators"
            | where ProcessCommandLine contains "/ad"
            | where not (FileName =~ "net1.exe" and InitiatingProcessFileName =~ "net.exe" and replace("net", "net1", InitiatingProcessCommandLine) =~ ProcessCommandLine)
            | where not(InitiatingProcessCommandLine has_any ("Scripts\\Startup\\Add_Admin.bat", "KACE"))
        EOT
      + query_frequency            = "PT1H"
      + query_period               = "PT1H"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "Persistence",
        ]
      + techniques                 = [
          + "T1078",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "Host"

          + field_mapping {
              + column_name = "DeviceName"
              + identifier  = "HostName"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = true
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "PT5H"
              + reopen_closed_incidents = false
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #78](https://github.com/AFMPE/mpe_management/actions/runs/4844999571)